Revit 2027 API
LabelUtils.GetLabelFor(gbXMLBuildingType, Document) Method
 Gets the user-visible name for a gbXMLBuildingType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GetLabelFor(
	gbXMLBuildingType buildingType,
	Document document
)
Public Shared Function GetLabelFor (
	buildingType As gbXMLBuildingType,
	document As Document
) As String
public:
static String^ GetLabelFor(
	gbXMLBuildingType buildingType,
	Document^ document
)
static member GetLabelFor :
        buildingType : gbXMLBuildingType *
        document : Document -> string
Parameters
buildingType gbXMLBuildingType
 The gbXMLBuildingType to get the user-visible name.
document Document
 The document from which to get the gbXMLBuildingType.
Return Value
String
 Returns the user-visible name for a buildingType in gbXML.
Exceptions
Exception | Condition
ArgumentException |  The input gXMLBuildingType is not available in the document.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The name is obtained in the current Revit language.
See Also
Reference
LabelUtils Class
GetLabelFor Overload
Autodesk.Revit.DB Namespace